//회원가입 상태바
export const stateItems = ['약관동의', '본인인증', '프로필 입력', '맞춤정보'];

//시청자 회원가입
//관심있는 상품은 무었인가요?
export const interestItems = [
  '의류',
  '구두/신발',
  '가방',
  '패션잡화\n(모자/벨트/액세서리)',
  '침구류/커튼',
  '가구\n(침대/소파/싱크대/DIY제품)',
  '영상가전(TV류)',
  '가정용 전기제품\n(냉장고/세탁기/식기세척기/전자레인지)',
  '계절가전\n(에어컨/온풍기)',
  '사무용기기\n(컴퓨터/노트북/프린터)',
  '광학기기\n(디지털카메라/캠코더)',
  '소형전자\n(MP3/전자사전 등)',
  '휴대폰',
  '내비게이션',
  '자동차용품\n(자동차부품/기타 자동차용품)',
  '의료기기',
  '주방용품',
  '화장품',
  '귀금속/보석/시계류',
  '식품(농수산물)',
  '가공식품',
  '건강기능식품',
  '영유아용품',
  '악기',
  '스포츠용품',
  '서적',
  '호텔/펜션 예약',
  '여행패키지',
  '항공권',
  '자동차 대여 서비스(렌터카)',
  '물품대여 서비스\n(정수기, 비데, 공기청정기 등)',
  '디지털 콘텐츠\n(음원, 게임, 인터넷강의 등)',
  '상품권/쿠폰',
  '기타 재화',
  '모바일 쿠폰',
  '영화 및 공연',
  '기타 용역',
];

//주로 어디에서 쇼핑을 하시나요?
export const whereShop = [
  '백화점',
  '아울렛',
  '마트',
  '홈쇼핑',
  'SNS',
  '드럭스토어',
  '공동구매',
  '해외직구',
  '기타',
];
//쇼핑 1회에 소비하는 평균 금액은 얼마인가요?
export const averageAmount = [
  '5만원 미만',
  '5~10만원',
  '10~20만원',
  '20~30만원',
  '30~50만원',
  '50만원 이상',
];

export const yesOrNo = ['예', '아니요'];

export const checkBoxArray = (array) => {
  let item = [];

  for (let i = 0; i < array.length; i++) {
    item.push({
      name: array[i],
      index: i,
    });
  }
  return item;
};
//셀러 회원가입
// 판매한 상품의 개당 판매 금액은 얼마인가요?
export const sellAverageAmount = [
  '5만원 미만',
  '5~10만원',
  '10~30만원',
  '30~50만원',
  '50~100만원',
  '100만원 이상',
];
//어떤 아이템을 판매 해보셨나요?(다중 선택 가능)
export const sellItems = [
  '리빙',
  '뷰티',
  '식품',
  '건강식품',
  '패션',
  '쥬얼리',
  '잡화',
  '전기전자',
  '가구',
  '인테리어',
  '여행',
  '펫',
  '유아',
  '기타',
];
//나의 채널 주요 연령
export const myViewerAge = [
  '12세 이하',
  '13~18세',
  '19~24세',
  '25~29세',
  '30~34세',
  '35~39세',
  '40-44세',
  '45~49세',
  '50~54세',
  '55~60세',
  '60세 이상',
];

//나의 외모는 어떤 유형인가요?
export const myFaceStyle = ['연예인형', '호감형', '친숙형', '유머형'];

//나의 목소리는 어떤 유형인가요?
export const myVoiceStyle = ['설명형', '신뢰형', '예능형', '감성형'];

//회망하는 셀러 활동 범위를 고르세요.
export const scope = ['알바셀러', '투잡셀러', '전문셀러'];

//라방을 통해 벌고픈 월 수익은 얼마인가요?
export const needRevenue = ['+5만원', '+10만원', '+100만원', '+1000만원'];

// 휴대폰 앞자리 번호
export const firstNumPhoneItems = ['010', '011', '016', '017', '018'];

// 배송 요청 사항 메세지
export const deliveryRequestMessage = [
  '배송 전 연락바랍니다.',
  '경비실에 맡겨주세요.',
  '집앞에 놔주세요.',
  '택배함에 놔주세요.',
  '부재시 핸드폰으로 연락주세요.',
  '부재시 경비실에 맡겨주세요.',
  '부재시 집 앞에 놔주세요.',
];

// 라이브 가격을 위한 상태 값
export const liveStatus = [3, 4, 5];

// 정보고시 카테고리 분류 {s}

// 의류
export const clothingCategory = [
  '제품 소재',
  '공통색상',
  '치수',
  '제조자, 수입품의 경우\n수입자를 함께 표기',
  '제조국',
  '제조연월',
  '세탁방법 및 취급시 주의사항',
];

// 구두 / 신발
export const shoseCategory = [
  '제품의 주소재',
  '색상',
  '발길이',
  '굽높이',
  '제조자, 수입품의 경우\n' + '수입자를 함께 표기',
  '제조국',
  '취급시 주의사항',
];

// 가방
export const bagCategory = [
  '종류',
  '소재',
  '색상',
  '크기',
  '제조자, 수입품의 경우\n' + '수입자를 함께 표기',
  '제조국',
  '취급시 주의사항',
];

// 패션잡화 (모자/벨트/액세서리)
export const fashionAccessoriesCategory = [
  '종류',
  '소재',
  '치수',
  '제조자, 수입품의 경우\n' + '수입자를 함께 표기',
  '제조국',
  '취급시 주의사항',
];

// 침구류 / 커튼
export const beddingCurtainCategory = [
  '제품 소재\n' + '(섬유의 조성 또는 혼용률을 백분율로 표시)',
  '충전재',
  '색상',
  '치수',
  '제품구성',
  '제조자, 수입품의 경우\n' + '수입자를 함께 표기',
  '제조국',
  '세탁방법 및 취급시 주의사항',
];

// 가구 (침대/소파/싱크대/DIY제품)
export const furnitureCategory = [
  'KC 인증 필 유무',
  '색상',
  '구성품',
  '주요 소재',
  '제조자, 수입품의 경우\n' + '수입자를 함께 표기',
  '제조국',
  '크기',
  '배송, 설치비용',
];

// 영상가전 (TV류)
export const imageHaCategory = [
  'KC 인증 필 유무',
  '정격전압, 소비전력,\n' + '에너지소비효율등급',
  '동일모델의 출시년월',
  '제조자, 수입품의 경우\n' + '수입자를 함께 표기',
  '제조국',
  '화면사양',
  '크기',
];

// 가정용 전기제품 (냉장고/세탁기/식기세척기/전자레인지)
export const electricProdductCategory = [
  'KC 인증 필 유무',
  '정격전압, 소비전력,\n' + '에너지소비효율등급',
  '동일모델의 출시년월',
  '제조자, 수입품의 경우\n' + '수입자를 함께 표기',
  '제조국',
  '크기',
];

// 계절가전 (에어컨/온풍기)
export const seasonHaCategory = [
  'KC 인증 필 유무',
  '정격전압, 소비전력,\n' + '에너지소비효율등급',
  '동일모델의 출시년월',
  '제조자, 수입품의 경우\n' + '수입자를 함께 표기',
  '제조국',
  '크기',
  '냉난방면적',
  '추가설치비용',
];

// 사무용기기 (컴퓨터/노트북/프린터)
export const officeApplianceCategory = [
  'KC 인증 필 유무',
  '정격전압, 소비전력,\n' + '에너지소비효율등급',
  '동일모델의 출시년월',
  '제조자, 수입품의 경우\n' + '수입자를 함께 표기',
  '제조국',
  '크기, 무게',
  '주요 사양',
];

// 광학기기 (디지털카메라/캠코더)
export const opticalInstrumentCategory = [
  'KC 인증 필 유무',
  '동일모델의 출시년월',
  '제조자, 수입품의 경우\n' + '수입자를 함께 표기',
  '제조국',
  '크기, 무게',
  '주요 사양',
];

// 소형전자 (MP3/전자사전 등)
export const smallElectronicCategory = [
  'KC 인증 필 유무',
  '정격전압, 소비전력,\n' + '에너지소비효율등급',
  '동일모델의 출시년월',
  '제조자, 수입품의 경우\n' + '수입자를 함께 표기',
  '제조국',
  '크기, 무게',
  '주요 사양',
];

// 휴대폰
export const phoneCategory = [
  'KC 인증 필 유무',
  '동일모델의 출시년월',
  '제조자, 수입품의 경우\n' + '수입자를 함께 표기',
  '제조국',
  '크기, 무게',
  '이동통신사',
  '가입절차',
  '소비자의 추가적인 부담사항',
  '주요사양',
];

// 네비게이션
export const navigationCategory = [
  'KC 인증 필 유무',
  '정격전압, 소비전력',
  '동일모델의 출시년월',
  '제조자, 수입품의 경우\n' + '수입자를 함께 표기',
  '제조국',
  '크기, 무게',
  '주요사양',
  '맵 업데이트 비용 및 무상기간',
];

// 자동차용품 (자동차부품/기타 자동차용품)
export const carAccessoriesCategory = [
  '동일모델의 출시년월',
  'KC 인증 필 유무',
  '제조자, 수입품의 경우\n' + '수입자를 함께 표기',
  '제조국',
  '크기',
  '적용차종',
  '제품사용으로 인한 위험 및\n' + '유의사항',
];

// 의료기기
export const regulatoryAffairsCategory = [
  '의료기기법상 허가, 신고 번호 및\n' + '광고사전심의필 유무',
  '정격전압, 소비전력(전기용품에 한함)',
  '동일모델의 출시년월',
  '제조자, 수입품의 경우\n' + '수입자를 함께 표기',
  '제조국',
  '제품의 사용목적 및 사용방법',
  '취급시 주의사항',
];

// 주방용품
export const kitchenUtensilsCategory = [
  '재질',
  '구성품',
  '크기',
  '동일모델의 출시년월',
  '제조자, 수입품의 경우\n' + '수입자를 함께 표기',
  '제조국',
  '식품위생법에 따른 수입기구,용기의\n' +
    '경우 "식품위생법에 따른\n' +
    '수입신고를 필함"의 문구',
];

// 화장품
export const cosmeticsCategory = [
  '용량 또는 중량',
  '제품 주요 사양',
  '사용기한 또는 개봉 후 사용기간',
  '사용방법',
  '제조자 및 제조판매업자',
  '제조국',
  '전성분',
  '기능성 화장품의 경우 화장품법에 따른\n' + '식품의약품안전처 심사 필 유무',
  '사용할 때 주의사항',
  '소비자상담관련 전화번호',
];

// 귀금속/보석/시계류
export const jewelryCategory = [
  '소재/순도/밴드재질(시계의경우)',
  '중량',
  '제조자, 수입품의 경우\n' + '수입자를 함께 표기',
  '제조국',
  '치수',
  '착용시 주의사항',
  '주요사항',
  '귀금속,보석류-등급',
  '시계-기능,방수 등',
  '보증서 제공여부',
];

// 식품(농수산물)
export const foodCategory = [
  '포장단위별 용량,수량,크기',
  '생산자, 수입품의 경우\n' + '수입자를 함께 표기',
  '농수산물의 원산지 표시에 관한\n' + '법률에 따른 원산지',
  '제조연월일(포장일 또는 생산연도),\n' + '유통기한 또는 품질 유지기한',
  '관련법상 표시사항',
  '농산물 - 농수산물품질관리법상\n' + '유전자변형농산물 표시, 지리적 표시',
  '축산물-축산법에 따른 등급 표시, 쇠고기의 경우 이력관리에 따른 표기 유무',
  '수산물 - 농수산물품질관리법상\n' + '유전자변형수산물 표시, 지리적표시',
  '수입식품에 해당하는 경우 "식품위생 법에 따른 수입신고를 필함"의 문구',
  '상품구성',
  '보관방법 또는 취급방법',
  '소비자상담관련 전화번호',
];

// 가공식품
export const processedFoodCategory = [
  '생산자 및 소재지(수입품의 경우 생산자, 수입자 및 제조국)',
  '제조연월일, 유통기한 또는\n' + '품질 유지기한',
  '포장단위별 용량(중량), 수량',
  '원재료명 및 함량\n' +
    '(농수산물의 원산지 표시에 관한 법률에 따른 원산지 표시 포함)',
  '영양성분 (식품위생법에 따른 영양성분 표시대상 식품에 한함)',
  '유전자재조합식품에\n' + '해당하는 경우의 표시',
  '영유아식 또는 체중조절식품 등에 해당하는 경우 표시광고사전심의필 유무및부작용발생가능성',
  '수입식품에 해당하는 경우 "식품위생 법에 따른 수입신고를 필함"의 문구',
  '소비자상담관련 전화번호',
];

// 건강기능식품
export const healthFunctionalFoodCategory = [
  '생산자 및 소재지(수입품의 경우 생산자, 수입자 및 제조국)',
  '제조연월일, 유통기한 또는\n' + '품질 유지기한',
  '포장단위별 용량(중량), 수량',
  '원재료명 및 함량\n' +
    '(농수산물의 원산지 표시에 관한 법률에 따른 원산지 표시 포함)',
  '영양정보',
  '기능정보',
  '섭취량, 섭취방법, 섭취시 주의사항 및부작용발생가능성',
  '질병의 예방 및 치료를 위한 의약품이 아니라는 내용의 표현',
  '유전자재조합식품에 해당하는 경우의 표시',
  '표시광고 사전 심의필',
  '수입식품에 해당하는 경우 "식품위생 법에 따른 수입신고를 필함"의 문구',
  '소비자상담관련 전화번호',
];

// 영유아용품
export const babyProductsCategory = [
  'KC 인증 필 유무',
  '크기, 중량',
  '색상',
  '재질',
  '사용연령 또는 체중범위',
  '동일모델의 출시년월',
  '제조자, 수입품의 경우\n' + '수입자를 함께 표기',
  '제조국',
  '취급방법 및 취급시 주의사항, 안전표시',
];

// 악기
export const instrumentCategory = [
  '크기',
  '색상',
  '재질',
  '제품구성',
  '동일모델의 출시년월',
  '제조자, 수입품의 경우\n' + '수입자를 함께 표기',
  '제조국',
  '상품별 세부사양',
];

// 스포츠용품
export const sportingGoodsCategory = [
  '크기, 중량',
  '색상',
  '재질',
  '제품구성',
  '동일모델의 출시년월',
  '제조자, 수입품의 경우\n' + '수입자를 함께 표기',
  '제조국',
  '상품별 세부사양',
];

// 서적
export const booksCategory = [
  '저자, 출판사',
  '크기',
  '쪽수',
  '제품구성',
  '출간일',
  '목차 또는 책소개\n' + '(아동용 학습교재의 경우 사용연령을 포함)',
];

// 호텔 / 펜션 예약
export const hotelPensionCategory = [
  '국가 또는 지역명',
  '숙소형태',
  '등급, 객실타입',
  '사용가능 인원, 인원 추가시 비용',
  '부대시설, 제공 서비스',
  '예약담당 연락처',
  '취소규정',
];

// 여행패키지
export const travelCategory = [
  '이용항공편',
  '여행기간 및 일정',
  '총예정인원,출발가능인원',
  '숙박정보',
  '포함 내역',
  '추가 경비 항목과 금액',
  '취소규정',
  '해외여행의 경우 외교통상부가 지정하는 여행경보단계',
  '예약담당 연락처',
];

// 항공권
export const airlineTicketCategory = [
  '요금조건, 왕복 편도 여부',
  '유효기간',
  '제한사항\n' + '(출발일, 귀국일 변경가능 여부 등)',
  '티켓수령방법',
  '좌석종류',
  '추가 경비 항목과 금액\n' + '(유류할증료, 공항이용료 등)',
  '취소 규정(환불, 위약금 등)',
  '예약담당 연락처',
];

// 자동차 대여 서비스 (렌터카)
export const carRentalCategory = [
  '차종',
  '소유권 이전 조건\n' + '(소유권이 이전되는 경우에 한함)',
  '추가 선택시 비용\n' + '(자차면책제도, 내비게이션 등)',
  '차량 반환시 연료대금 정산 방법',
  '차량의 고장, 훼손시 소비자 책임',
  '예약또는중도해약시환불기준',
  '소비자상담 관련 전화번호',
];

// 물품대여 서비스 (정수기, 비데, 공기청정기 등)
export const productRentalCategory = [
  '소유권 이전 조건\n' + '(소유권이 이전되는 경우에 한함)',
  '유지보수 조건',
  '상품의 고장, 분실, 훼손시 소비자 책임',
  '중도 해약시 환불 기준',
  '제품 사양',
  '소비자상담관련 전화번호',
];

// 디지털 콘텐츠 (음원, 게임, 인터넷강의 등)
export const digitalContentsCategory = [
  '제작자 또는 공급자',
  '이용조건, 이용기간',
  '상품 제공 방식\n' + '(CD, 다운로드, 실시간 스트리밍 등)',
  '최소 시스템 사양, 필수 소프트웨어',
  '청약철회 또는 계약의 해제,\n' + '해지에 따른 효과',
  '소비자상담관련 전화번호',
];

// 상품권 / 쿠폰
export const giftCardCouponCategory = [
  '발행자',
  '유효기간, 이용조건',
  '이용가능매장',
  '잔액 환급 조건',
  '소비자상담관련 전화번호',
];

// 기타 재화
export const etcGoodsCategory = [
  '품명 및 모델명',
  '법에 의한 인증,허가 등을 받았음을 확인할 수 있는 경우 그에 대한 사항',
  '제조국 또는 원산지',
  '제조자, 수입품의 경우\n' + '수입자를 함께 표기',
];

// 모바일쿠폰
export const mobileCouponCategory = [
  '유효기간, 이용조건\n' + '(유효기간 경과시 보상 기준 포함)',
  '이용 가능 매장',
  '환불조건',
  '환불방법',
  '소비자상담관련 전화번호',
];

// 영화 및 공연
export const moviePerformanceCategory = [
  '주최 또는 기획(공연에 한함)',
  '주연(공연에 한함)',
  '관람등급',
  '상영·공연시간',
  '상영·공연장소',
  '예매 취소 조건',
  '취소·환불방법',
  '소비자상담관련 전화번호',
];

// 기타 용역
export const etcService = [
  '서비스 제공 사업자',
  '법에 의한 인증·허가 등을 받았음을 확인할 수 있는 경우 그에 대한 사항',
  '이용조건\n' + '(이용가능 기간·장소, 추가비용 등)',
  '취소·중도해약·해지 조건 및 환불기준',
  '취소·환불방법',
  '소비자상담관련 전화번호',
];

// 정산관리 계좌 은행
export const banksList = [
  'KB국민은행',
  'SC제일은행',
  '경남은행',
  '광주은행',
  '기업은행',
  '농협',
  '대구은행',
  '부산은행',
  '산업은행',
  '새마을금고',
  '수협',
  '신한은행',
  '신협',
  '외환은행',
  '우리은행',
  '우체국',
  '전북은행',
  '축협',
  '카카오뱅크',
  '케이뱅크',
  '하나은행',
  '한국씨티은행',
];
// 정보고시 카테고리 분류 {e}
